In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
df = pd.DataFrame(randn(4,3), ['a', 'b', 'c', 'd'], ['X', 'Y', 'Z'])

In [4]:
df

          X         Y         Z
a -0.324202  1.514365  1.015539
b -0.138887  2.303974  0.832093
c -0.533766 -0.599869 -1.018732
d  0.110845  0.183573  0.055816

In [5]:
bool_df = df > 0

In [6]:
bool_df

       X      Y      Z
a  False   True   True
b  False   True   True
c  False  False  False
d   True   True   True

In [7]:
df[bool_df]

          X         Y         Z
a       NaN  1.514365  1.015539
b       NaN  2.303974  0.832093
c       NaN       NaN       NaN
d  0.110845  0.183573  0.055816

#таже запись

In [8]:
df[df>0]

          X         Y         Z
a       NaN  1.514365  1.015539
b       NaN  2.303974  0.832093
c       NaN       NaN       NaN
d  0.110845  0.183573  0.055816

In [9]:
df

          X         Y         Z
a -0.324202  1.514365  1.015539
b -0.138887  2.303974  0.832093
c -0.533766 -0.599869 -1.018732
d  0.110845  0.183573  0.055816

In [10]:
df['Y'] > 1

a     True
b     True
c    False
d    False
Name: Y, dtype: bool

In [11]:
type(df['Y'])

pandas.core.series.Series

In [12]:
df[df['Z'] > 1]

          X         Y         Z
a -0.324202  1.514365  1.015539

In [13]:
df

          X         Y         Z
a -0.324202  1.514365  1.015539
b -0.138887  2.303974  0.832093
c -0.533766 -0.599869 -1.018732
d  0.110845  0.183573  0.055816

In [14]:
res_df = df[df['X'] < 0]

In [15]:
res_df

          X         Y         Z
a -0.324202  1.514365  1.015539
b -0.138887  2.303974  0.832093
c -0.533766 -0.599869 -1.018732

In [16]:
res_df['Z']

a    1.015539
b    0.832093
c   -1.018732
Name: Z, dtype: float64

In [17]:
df[df['X'] < 0][['X', 'Z']]

          X         Z
a -0.324202  1.015539
b -0.138887  0.832093
c -0.533766 -1.018732

In [18]:
df

          X         Y         Z
a -0.324202  1.514365  1.015539
b -0.138887  2.303974  0.832093
c -0.533766 -0.599869 -1.018732
d  0.110845  0.183573  0.055816

In [19]:
df[(df['X'] < 0) & (df['Z'] < 0)]

          X         Y         Z
c -0.533766 -0.599869 -1.018732

In [20]:
df[(df['X'] < 0) | (df['Z'] < 0)]

          X         Y         Z
a -0.324202  1.514365  1.015539
b -0.138887  2.303974  0.832093
c -0.533766 -0.599869 -1.018732

In [21]:
df.reset_index()

  index         X         Y         Z
0     a -0.324202  1.514365  1.015539
1     b -0.138887  2.303974  0.832093
2     c -0.533766 -0.599869 -1.018732
3     d  0.110845  0.183573  0.055816

In [22]:
df

          X         Y         Z
a -0.324202  1.514365  1.015539
b -0.138887  2.303974  0.832093
c -0.533766 -0.599869 -1.018732
d  0.110845  0.183573  0.055816

In [23]:
z1 = [1,2,3,4]

In [24]:
df['Z1'] = z1

In [25]:
df

          X         Y         Z  Z1
a -0.324202  1.514365  1.015539   1
b -0.138887  2.303974  0.832093   2
c -0.533766 -0.599869 -1.018732   3
d  0.110845  0.183573  0.055816   4

In [26]:
df.set_index('Z1')

           X         Y         Z
Z1
1  -0.324202  1.514365  1.015539
2  -0.138887  2.303974  0.832093
3  -0.533766 -0.599869 -1.018732
4   0.110845  0.183573  0.055816

In [27]:
df

          X         Y         Z  Z1
a -0.324202  1.514365  1.015539   1
b -0.138887  2.303974  0.832093   2
c -0.533766 -0.599869 -1.018732   3
d  0.110845  0.183573  0.055816   4